//
//  Localizable.strings
//  Nextcloud
//
//  Copyright © 2017 Marino Faggiana. All rights reserved.
//
//  Author Marino Faggiana <marino.faggiana@nextcloud.com>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

"_cancel_"                  = "إلغاء";
"_edit_"                    = "تعديل";
"_tap_to_cancel_"           = "انقر للإلغاء";
"_tap_to_min_max_"          = "Tap to minimize / maximize";
"_cancel_request_"          = "هل تريد الالغاء؟";
"_upload_file_"             = "رفع ملف";
"_download_file_"           = "تنزيل ملف";
"_delete_"                  = "حذف";
"_rename_"                  = "إعادة التسمية";
"_rename_file_"             = "تغيير تسمية ملف";
"_rename_folder_"           = "تغيير تسمية مجلد";
"_move_"                    = "نقل";
"_add_"                     = "إضافة";
"_save_"                    = "حفظ";
"_warning_"                 = "تحذير";
"_error_"                   = "خطأ";
"_no_"                      = "لا";
"_yes_"                     = "نعم";
"_select_"                  = "تحديد";
"_select_all_"              = "تحديد الكل";
"_upload_"                  = "رَفْع";
"_home_"                    = "الملفات";
"_files_"                   = "الملفات";
"_ok_"                      = "موافق";
"_done_"                    = "تمّ";
"_clear_"                   = "محو";
"_selected_"                = "تمّ التحديد";
"_no_active_account_"       = "لم يتم العثور على اي حساب";
"_info_"                    = "معلومات";
"_warning_"                 = "تحذير";
"_video_"                   = "فيديو";
"_overwrite_"               = "تخطِّي";
"_create_"                  = "إنشاء";
"_create_folder_"           = "إنشاء مجلد";
"_create_folder_e2ee_"      = "إنشاء مجلد مشفر";
"_close_"                   = "إغلاق";
"_remove_"                  = "حذف";
"_file_not_found_"          = "تعذر العثور على الملف";
"_continue_"                = "متابعة";
"_continue_editing_"        = "إستمر في التحرير";
"_auto_upload_folder_"      = "رفع تلقائي";
"_photo_"                   = "صورة";
"_audio_"                   = "الصوت";
"_unknown_"                 = "مجهول";
"_success_"                 = "نجاح";
"_mode_filename_"           = "وضع اسم الملف";
"_warning_owncloud_"        = "أنت تستعمل الآن خادوم owncloud. و الذي هو غير مدعوم و استعمالك له على مسؤوليتك الشخصية. قم بالترقية إلى نكست كلاود. أنظُر: https://nextcloud.com/migration.";
"_warning_unsupported_"     = "أنت تستعمل إصداراً غير مدعوم من نكست كلاود. لسلامة بياناتك، ننصحك بشدة بالتحديث لآخر إصدار مستقر من نكست كلاود.";
"_restore_"                 = "استعادة ";
"_tap_here_to_change_"      = "أنقُر هنا للتغيير";
"_no_albums_"               = "لا توجد ألبومات";
"_denied_album_"            = "هذا التطبيق لا يمكنه الوصول إلى \"الصِّوَر\" photos. يمكنك تمكين الوصول في إعدادات الخصوصية Privacy Settings. ";
"_denied_camera_"           = "هذا التطبيق لا يمكنه الوصول إلى \"الكاميرا\" Camera. يمكنك تمكين الوصول في إعدادات الخصوصية Privacy Settings. ";
"_force_start_"             = "فَرْضُ البَدْءِ";
"_account_does_not_exist_"  = "The account %@ does not exist. Please log in again.";
"_sharing_"                 = "المشاركة";
"_details_"                 = "تفاصيل";
"_no_permission_add_file_"  = "ليس عندك الإذن بإضافة ملفات.";
"_no_permission_delete_file_" = "ليس عندك الإذن بحذف ملفات.";
"_no_permission_modify_file_" = "ليس عندك الإذن بتعديل ملفات.";
"_no_permission_favorite_file_" = "ليس عندك الإذن بإضافة الملف إلى المُفضَّلَة.";
"_add_folder_info_"         = "إضافة معلومات المجلد";
"_back_"                    = "عودة";
"_search_"                  = "بحث";
"_search_or_create_tags"    = "Search or create tag";
"_tags_"                    = "Tags";
"_share_tags_create_"       = "Create \"%@\"";
"_share_tags_no_results_"   = "No tags found";
"_share_tags_added_named_"  = "Tag %@ has been created.";
"_edit_tags_"               = "Manage tags";
"_create_tag_error_"        = "New tag could not be created. Please try again.";
"_of_"                      = "من";
"_livephoto_save_"          = "حفظ الصِّوَر الحيّة في ألبوم الصِّوَر";
"_livephoto_save_error_"    = "حدث خطأ أثناء حفظ الصور الحيّة.";
"_livephoto_no_"            = "تعطيل الصور الحية Live Photo";
"_convert_live_photo_"      = "تحويل إلى صور مباشرة";
"_file_conflict_num_"       = "تعارُض ملفات";
"_file_conflicts_num_"      = "تعارُضات ملفات";
"_file_conflict_desc_"      = "ما هي الملفات التي تريد الاحتفاظ بها؟\nإذا اخترت الاحتفاظ بكليهما، فسيتم إلحاق رقم تسلسلي باسم النسخة الجديدة من الملف.";
"_file_conflict_new_"       = "ملفات جديدة";
"_file_conflict_exists_"    = "الملفات موجودة سلفاً";
"_file_not_rewite_doc_"     = "ليس من الممكن الكتابة فوق مستند ولكن من الممكن فقط إنشاء مستند جديد.";
"_move_or_copy_"            = "أنقُل أو انسَخ";
"_move_copy_diff_account_"  = "You cannot copy or move files between different accounts.";
"_copy_"                    = "إنسَخ";
"_now_"                     = "الآن";
"_wait_"                    = "الرجاء الانتظار...";
"_recent_"                  = "آخِرُ ما تمّ العمل عليه";
"_view_in_folder_"          = "عرض في المجلد";
"_leave_share_"             = "مغادرة هذه المشاركة";
"_disabled_"                = "مُعطّل";
"_compact_"                 = "Compact";
"_normal_"                  = "عادي";
"_verbose_"                 = "Verbose";
"_standard_"                = "قياسي";
"_maximum_"                 = "الأقصى";
"_error_occurred_"          = "حدث خطأ. يرجى المحاولة مرة أخرى.";
"_retry_"                   = "أعد المحاولة";
"_images_"                  = "الصِّوَر";
"_confirm_"                 = "تأكيد";
"_confirm_continue_"        = "Confirm by continuing the previous uploading";
"_confirm_resetting_"       = "Confirm ignoring previous uploading";
"_background_location_access_title_"    = "Background Location Access";
"_background_location_access_message_"  = "This app needs background location access to automatically upload files when you move between areas. GPS is not used and your location is never stored.";
"_enable_background_location_title_"    = "Enable Background Location";
"_enable_background_location_message_"  = "To allow automatic file uploads in the background, please enable 'Always' for location access in Settings.";
"_enable_background_location_footer_"   = "To keep your photo library up to date automatically, this app can use background location access.\nThis allows it to detect when you’re in a new area and check for new photos to upload.\nGPS is not used, and your location is never stored or tracked.";

/* MARK: Files lock */

"_lock_"                            = "القَفْل";
"_unlock_"                          = "الغاء القفل";
"_lock_file_"                       = "أقفِل الملف";
"_unlock_file_"                     = "فتح قُفْل الملف";
"_lock_selected_files_"             = "قَفْل الملفات";
"_unlock_selected_files_"           = "فتح الملفات";
"_locked_by_"                       = "مُقفَل من قِبَل %@";
"_file_locked_no_override_"         = "هذا الملف مُقفَلٌ. لا يمكن تجاوزه.";
"_lock_no_permissions_selected_"    = "غير مسموح به لبعض الملفات و المجلدات المحددة.";
"_remove_file_"             = "إزالة الملف";
"_delete_file_"             = "حذف الملف";
"_delete_folder_"           = "حذف المجلد";
"_size_"                    = "الحجم";
"_set_user_status_"         = "الحالة على الخط";
"_set_user_status_message_" = "Status message";
"_open_settings_"           = "فتح الإعدادات";
"_settings_account_request_" = "طلب الحساب عند بدء التشغيل";
"_alias_"                   = "الاسم المستعار";
"_alias_placeholder_"       = "Write alias";
"_alias_footer_"            = "Give your accounts a descriptive name such as Home, Office, School…";
"_privacy_legal_"           = "الخصوصية والسياسة القانونية";
"_source_code_"             = "الحصول على الشفرة المصدرية";
"_account_select_"          = "إختَر الحساب";
"_account_select_to_add_"   = "إختَر الحساب لإضافته";
"_remove_local_account_"    = "حذف الحساب المحلي";
"_want_delete_account_"     = "هل ترغب في إزالة الحساب المحلي؟";
"_prevent_http_redirection_"= "غير مسموح بإعادة توجيه HTTP.";
"_single_file_conflict_title_" = "تضارب ملفات";
"_multi_file_conflict_title_" = "%@ ملف متضارب";
"_replace_action_title_" = "استبدال";
"_keep_both_action_title_" = "الاحتفاظ بالنسختين";
"_cancel_keep_existing_action_title_" = "إلغِ العملية واحتفِظ بكل الموجود";
"_replace_all_action_title_" = "إستبدِل الكل";
"_keep_both_for_all_action_title_" = "إحتفِظ بكليهما للكل";
"_more_action_title_" = "المزيد من التفاصيل";
"_wait_file_preparation_" = "Preparing file upload. Please wait …";
"_keep_active_for_upload_" = "Keep application active until upload is completed …";
"_keep_active_for_transfers_" = "Keep application active until the transfers are completed …";
"_wait_file_encryption_"  = "يرجى الانتظار. يجري تشفير الملف ...";
"_passcode_counter_fail_" = "محاولات فاشلة أكثر مما يجب. رجاءً، إنتظر لبعض الوقت قبل إعادة المحاولة.";
"_seconds_"               = "ثوانٍ";
"_change_lock_passcode_"  = "تغيير رمز المرور";
"_lock_cannot_disable_mdm_" = "تعطيل قَفْل رمز المرور غير مسموح به ملف تعريف التكوين الخاص بك configuration profile.";

// MARK: User Status

/* User status */
"_online_"                  = "متصل";

/* User status */
"_away_"                    = "في الخارج";

/* User status */
"_dnd_"                     = "يُرجى عدم الإزعاج";

/* User status */
"_dnd_description_"         = "كتم جميع الإشعارات";

/* User status */
"_invisible_"               = "غير مرئي";

/* User status */
"_invisible_description_"   = "يظهر غير متصل";

/* User status */
"_busy_"                    = "Busy";

/* User status */
"_select_user_status_"      = "Set online status";
"_select_status_message_"      = "تعيين رسالة الحالة";
"_status_message_"          = "رسالة الحالة";
"_status_message_placehorder_"  = "ماهي حالتك؟";
"_online_status_"           = "الحالة على الخط";
"_set_status_message_"      = "تعيين رسالة الحالة";
"_clear_status_message_after_"  = "Clear status after";

/* User status */
"_select_option_"           = "تحديد خيار";
"_dont_clear_"              = "لا تمسح";
"_15_minutes_"              = "15 minutes";
"_30_minutes_"              = "30 دقيقة";
"_an_hour_"                 = "ساعة ";
"_1_hour_"                  = "1 ساعة";
"_4_hours_"                 = "4 ساعات";
"_day_"                     = "Today";
"_this_week_"               = "هذا الأسبوع";
"_days_"                    = "أيام";
"_hours_"                   = "ساعات";
"_minutes_"                 = "دقائق";


"_network_not_available_"   = "الشبكة غير متاحة.";
"_file_already_exists_"     = "لايمكن الاستمرار في الإجراء. يوجد ملف آخر بنفس الاسم.";
"_files_lock_error_"        = "كان هنالك خطأ بتغيير قَفْل الملف.";
"_more_"                        = "المزيد";
"_notifications_"               = "الإشعارات";
"_quota_space_unlimited_"       = "غير محدود";
"_quota_space_unknown_"         = "مجهول";
"_quota_using_"                 = "أنت تستخدم %@ مِن أصل %@";
"_acknowledgements_"            = "شكرٌ و تقديرٌ";
"_settings_"                    = "الإعدادات";
"_enter_password_"              = "أدخِل كلمة المرور ...";
"_lock_"                        = "القَفْل";
"_lock_active_"                 = "القَفْل: فعّال";
"_lock_not_active_"             = "القَفْل: لا يعمل";
"_lock_protection_no_screen_"        = "لا تسأل عند بدء التشغيل";
"_enable_touch_face_id_"        = "قم بتمكين Touch / Face ID";
"_wifi_only_"                   = "استخدم اتصال Wi-Fi فقط";
"_settings_autoupload_"         = "رفع تلقائي للصور";
"_clear_cache_"                 = "مَسْح ذاكرة التخزين المؤقتة";
"_clear_cache_footer_"          = "مَحُو الملفات المحملة downloaded والمتوفرة بدون إتصال offline من التطبيق";
"_exit_"                        = "إعادة تعيين التطبيق";
"_exit_footer_"                 = "حذف كل الحسابات و البيانات المحلية من التطبيق.";
"_want_exit_"                   = "إنتبِه! ستتم إعادة التعيين إلى الحالة الأوّلية. استمرار؟";
"_want_delete_cache_"           = "هل تريد حذف الذاكرة المؤقتة (يؤدي هذا أيضًا إلى حذف عمليات النقل الجارية)؟";
"_add_account_"                 = "إضافة حساب";
"_want_delete_"                 = "أنت ستقوم بحذف ما يلي:";
"_want_leave_share_"            = "أنت سوف تغادر المشاركات التالية:";
"_no_delete_"                   = "لا ، لا تحذِف";
"_yes_delete_"                  = "نعم، إحذِف";
"_information_"                 = "معلومات";
"_select_offline_warning_"      = "قد تستغرق إتاحة العديد من الملفات والمجلدات في وضع عدم الاتصال offline بعض الوقت و تستخدم قدرًا كبيرًا من الذاكرة.";
"_advanced_"                    = "مُتقدِّمة";
"_permissions_"                 = "الأذونات";
"_custom_permissions_"          = "Custom permissions";
"_disable_files_app_"           = "تعطيل تكامل تطبيق الملفات Files";
"_disable_files_app_footer_"    = "لا تسمح بالوصول إلى الملفات عبر تطبيق \"الملفات\" في iOS.";
"_time_remaining_"              = "%@ مُتبقٍِّ";
"_autoupload_"                      = "رفع الصور أو مقاطع الفيديو تلقائيًا";
"_autoupload_select_folder_"        = "تحديد مجلد \"الرفع التلقائي\"";
"_autoupload_photos_"               = "رفع تلقائي للصور";
"_autoupload_videos_"               = "رفع تلقائي لمقاطع الفيديو";
"_autoupload_favorites_"            = "التحميل التلقائي للمفضلات فقط";
"_autoupload_description_"          = "Choose whether new photos or videos will be automatically uploaded to your account.";
"_autoupload_fullphotos_"           = "رفع لفة الكاميرا camera roll بالكامل";
"_start_autoupload_"                = "Turn on auto upload";
"_stop_autoupload_"                 = "Turn off auto upload";
"_autoupload_fullphotos_footer_"    = "قُم بضبط الخيارات أعلاه قبل الرفع.";
"_autoupload_create_subfolder_"     = "إستخدِم مجلدات فرعية";
"_autoupload_create_subfolder_footer_"  = "تخزين الصِّوَر في مجلدات فرعية بحسب السنة والشهر واليوم.";
"_autoupload_subfolder_granularity_"    = "مدة تفصيل المجلد الفرعي";
"_filenamemask_"                        = "تغيير قناع mask اسم الملف";
"_filenamemask_footer_"                 = "تلقائيّاً، بمجرد رفع الملف سيأخذ الصيغة التالية: yy-mm-dd hh-mm-ss ملحقاً بها 4 خانات تمثل عدداً مسلسلاً. إذا لم تعجبك هذه الصيغة، يمكنك تغييرها فيما عدا الـ 4 خانات و التي هي إلزامية.";
"_autoupload_current_folder_"           = "المجلد المُحدّد حاليًا";
"_show_hidden_files_"           = "عرض الملفات المخفية";
"_format_compatibility_"        = "الأكثر توافقًا";
"_format_compatibility_footer_" = "\"الأكثر توافقًا\" سيحفظ الصور بتنسيق JPEG، إن أمكن.";
"_privacy_"                     = "الخصوصية";
"_privacy_footer_"              = "هذا التطبيق يستعمل خدمة تحليل الأعطال analysis of a crash. لكن لن يتم إرسال أي معلومات شخصية لك ضمن تقرير العطل. يمكنك إذا رغبت تعطيل هذه الخدمة من خلال تغيير الإعداد و تمكين \"تعطيل تقرير الأعطال Disable crash reporter\".";
"_crashservice_title_"          = "تعطيل المُبَلِّغ عن الأعطال crash reporter";
"_crashservice_alert_"          = "هذا الخيار يحتاج إلى إعادة تشغيل التطبيق ليأخذ مفعوله.";
"_upload_mov_livephoto_"        = "Live Photo";
"_upload_mov_livephoto_footer_" = "سوف تقوم \" الصور الحية Live Photo\" بحفظ الصور المحددة بتنسيق \"Live Photo\"، إن أمكن.";
"_capabilities_"                = "القدرات";
"_capabilities_footer_"         = "عرض الحزم المُستخدَمة من التطبيق إذا كانت مُثبَّتة و متاحة على الخادم.";
"_diagnostics_"                 = "التشخيص";
"_diagnostics_footer_"          = "تغيير مستوى السجل يستلزم إعادة تشغيل التطبيق لتفعيله";
"_view_log_"                    = "عرض ملف سجل الأحداث";
"_clear_log_"                   = "مسح ملف سجل الأحداث";
"_set_log_level_"               = "تعيين مستوى سجل الأحداث";
"_log_file_clear_alert_"        = "تمّ مسح ملف سجل الأحداث بنجاح!";
"_connect_server_anyway_"       = "هل تريد الاتصال بالخادوم على كل حال؟";
"_server_is_trusted_"           = "هل تعتبر هذا الخادم موثوق؟";
"_connection_error_"            = "خطأٌ في الاتصال";
"_login_url_"                   = "عنوان الخادم  https:// ...";
"_login_url_error_"             = "خطأ في عنوان URL. يُرجى التحقق من عنوان URL الخاص بالخادوم";
"_login_error_"                 = "Could not log in. Please try again later.";
"_favorites_"                   = "المفضلة";
"_favorite_short_"              = "المفضلة ";
"_tutorial_favorite_view_"      = "الملفات والمجلدات التي حددتها كَمفضلة سوف تظهر هنا";
"_tutorial_offline_view_"       = "الملفات المنسوخة هنا ستكون متاحة بلا اتصال بالإنترنت.\n\nستتم مزامنتها مع سحابتك.";
"_tutorial_groupfolders_view_"  = "No team folders yet";
"_more_"                        = "المزيد";
"_favorite_no_files_"           = "ليست عندك مفضلات حتى الآن";
"_no_date_information_"                     = "لا معلومات عن التاريخ";
"_no_camera_information_"                   = "لا معلومات عن الكاميرا";
"_no_lens_information_"                     = "لا معلومات عن العدسة";
"_today_"                                   = "اليوم";
"_yesterday_"                               = "أمس";
"_access_photo_not_enabled_"                = "الوصول للصِّوَر غير مسموح";
"_access_photo_not_enabled_msg_"            = "رجاءً، إذهب إلى \"الإعدادات\" ← \"نكست كلاود\" ← \"الصِّوَر\" ثم قُم بتمكين \"الوصول إلى مكتبة الصِّوَر\"";
"_access_background_app_refresh_denied_"    = "تم رفض \"تحديث التطبيقات في الخلفية\". يرجى تمكين ذلك في \"الإعدادات\" و إلاّ فلن يتم اكتشاف الصور أو مقاطع الفيديو الجديدة عندما يكون التطبيق في الخلفية";
"_new_photos_starting_"                     = "فقط الصور والمقاطع المرئية التي تبدأ بـ %@ سيتم رفعها.";
"_tutorial_photo_view_"                     = "لا توجد أيّ صور أو مقاطع فيديو مرفوعةٌ حتى الآن";
"_error_createsubfolders_upload_"           = "خطأ في إنشاء المجلدات الفرعية";
"_remove_photo_CameraRoll_"                 = "حذف من لفّة الكاميرا camera roll";
"_remove_photo_CameraRoll_desc_"            = "\"حذف من لفّة الكاميرا\" camera roll بعد التحميل. سيتم عرض رسالة تأكيد لحذف الصور أو مقاطع الفيديو التي تم تحميلها من ألبوم الكاميرا. ستظل الصور أو مقاطع الفيديو المحذوفة متاحة في سلة مهملات صور نظام تشغيل iOS لمدة 30 يومًا.";
"_never_"                       = "بتاتاً";
"_less_a_minute_"               = "أقل من دقيقه مضت";
"_a_minute_ago_"                = "منذ دقيقة واحدة";
"_minutes_ago_"                 = "منذ %d دقيقة مضت";
"_an_hour_ago_"                 = "منذ ساعة مضت";
"_hours_ago_"                   = "منذ %d ساعات مضت";
"_a_day_ago_"                   = "منذ يوم واحد";
"_days_ago_"                    = "منذ %d أيام مضت";
"_forbidden_characters_"        = "حروف ممنوعة: %@";
"_cannot_send_mail_error_"      = "لم يسبق تهيئة أي حسابات أو أن عنوان البريد الإلكتروني المُدخَل غير صحيح.";
"_open_url_error_"              = "يتعذّر فتح عنوان URL لهذا الإجراء.";
"_media_"                       = "الوسائط";
"_order_by_"                    = "الترتيب بحسب";
"_name_"                        = "الإسم";
"_date_"                        = "التاريخ";
"_size_"                        = "الحجم";
"_delete_selected_files_"       = "حذف ملفات";
"_remove_favorites_"            = "غير مفضلة";
"_add_favorites_"               = "المفضلة ";
"_share_"                       = "شارك";
"_remove_local_file_"           = "إحذِف محلّياً";
"_folders_"                     = "مجلدات";
"_folder_"                      = "مجلد";
"_files_"                       = "الملفات";
"_file_"                        = "ملف";
"_no_file_pull_down_"           = "قم برفع ملف أو اسحب لأسفل للتحديث";
"_no_file_no_permission_to_create_" = "You don't have permission to create or upload files in this folder.";
"_limited_dimension_"           = "تمّ الوصول إلى الحجم الأقصى";
"_save_selected_files_"         = "حفظ في معرض الصور";
"_file_not_saved_cameraroll_"   = "خطأ: لم يتم حفظ الملف في ألبوم الصور";
"_file_saved_cameraroll_"       = "تم حفظ الملف في ألبوم الصور";
"_favorite_on_top_"             = "Sort favorite first";
"_directory_on_top_"            = "Sort folders before files";
"_show_description_"            = "Show folder description";
"_show_recommended_files_"      = "Show recommendations";
"_search_no_record_found_"      = "لا نتائج";
"_search_in_progress_"          = "البحث جارٍ ...";
"_search_instruction_"          = "إبحَث عن ملف (بحد أدنى 2 حرف)";
"_files_no_files_"              = "لا توجد ملفات هنا";
"_files_no_folders_"            = "لا توجد مجلدات هنا";
"_request_in_progress_"         = "الطلب من الخادم قيد التنفيذ...";
"_personal_files_only_"         = "ملفات شخصية فقط";

"audio"                         = "الصوت";
"directory"                     = "المجلدات";
"document"                      = "المستندات";
"image"                         = "الصور";
"template"                      = "القوالب";
"video"                         = "فيديو";

"_paste_file_"                  = "لصق";
"_cancel_all_task_"             = "إلغاء جميع عمليات النقل";
"_status_wait_download_"        = "في انتظار التنزيل ...";
"_status_downloading_"          = "التنزيل جارٍ ...";
"_status_wait_upload_"          = "إنتظار الرفع";
"_status_wait_create_folder_"   = "في انتظار إنشاء المجلد ...";
"_status_wait_delete_"          = "في انتظار الحذف ...";
"_status_wait_rename_"          = "في انتظار تغيير الاسم";
"_status_wait_favorite_"        = "في انتظار تغيير المفضلة";
"_status_wait_copy_"            = "في انتظار النسخ ...";
"_status_wait_move_"            = "في انتظار النقل ...";
"_status_uploading_"            = "الرفع جارٍ ...";
"_status_upload_error_"         = "خطأ. في انتظار الرفع";
"_select_media_folder_"         = "تعيين مجلد الوسائط";
"_media_viewimage_show_"        = "إعرِض الصور فقط";
"_media_viewvideo_show_"        = "إعرِض الفيديو فقط";
"_media_show_all_"              = "إعرِض الكل";
"_good_morning_"                = "صباح الخير";
"_good_day_"                    = "نهارك سعيد";
"_good_afternoon_"              = "ظهيرة سعيدة";
"_good_evening_"                = "مساء الخير";
"_good_night_"                  = "ليلة سعيدة";
"_servers_"                     = "الخوادم";
"_select_server_"               = "من فضلك، قم بتحديد الخادم ...";

// MARK: Share

"_share_link_"                  = "مشاركة الرابط";
"_share_link_name_"             = "اسم الرابط";
"_password_"                    = "كلمة المرور";
"_share_password_"              = "رابط محمي بكلمة مرور";
"_date_"                        = "التاريخ";
"_user_sharee_footer_"          = "إضغط لتغيير الصلاحيات";
"_enforce_password_protection_" = "فرض الحماية بكلمة مرور";
"_shared_with_you_by_"          = "مشاركة معك من قبل";
"_shareLinksearch_placeholder_" = "الاسم و الإيميل و مُعرِّف السحابة الموحدة...";
"_new_comment_"                 = "تعليق جديد ...";
"_edit_comment_"                = "تعديل التعليق";
"_delete_comment_"              = "حذف التعليق";
"_share_read_only_"             = "للعرض فقط";
"_share_editing_"               = "Can edit";
"_share_allow_upload_"          = "السماح بالرفع و التعديل";
"_share_file_drop_"             = "File request";
"_share_secure_file_drop_"      = "الإفلات الآمن للملف (للرفع فقط)";
"_share_hide_download_"         = "إخفاء التنزيل";
"_share_allowed_downloads_"     = "Allowed downloads";
"_share_limit_download_"        = "تقييد عدد التنزيلات";
"_remaining_"                   = "%d متبقية";
"_share_password_protect_"      = "الحماية بكلمة المرور";
"_share_expiration_date_"       = "تعيين تاريخ إنتهاء الصلاحية";
"_share_note_recipient_"        = "ملاحظة للمُستَلِم";
"_share_add_sharelink_"         = "إضافة رابط آخر";
"_share_can_read_"              = "Read";
"_share_can_reshare_"           = "مشاركة";
"_share_can_create_"            = "إنشاء";
"_share_can_change_"            = "تعديل";
"_share_can_delete_"            = "حذف";
"_share_can_download_"          = "Allow download and sync";
"_share_unshare_"               = "Delete share";
"_share_internal_link_"         = "رابط داخلي";
"_share_internal_link_des_"     = "تعمل فقط مع المستخدِمين الذين لهم حق الوصول إلى هذا الملف أو المجلد.";
"_share_reshare_disabled_"      = "أنت غير مأذونٍ لك بإعادة مشاركة هذا الملف أو المجلد,";
"_share_reshare_restricted_"    = "ملاحظة: لديك إذن محدود بإعادة مشاركة هذا الملف أو المجلد.";
"_remote_"                      = "عن بعد";
"_remote_group_"                = "Remote group";
"_conversation_"                = "Conversation";

"_no_transfer_"                     = "لا توجد تحويلات حتى الآن";
"_no_transfer_sub_"                 = "ستظهر عمليات التنزيل والرفع  من هذا الجهاز هنا";
"_no_activity_footer_"              = "لا يوجد المزيد من الأنشطة للتحميل";
"_transfers_"                       = "التحويلات";
"_activity_"                        = "الأنشطة";
"_trash_file_not_found_"            = "يبدو أن الملف غير موجود في سلة المهملات. إذهب إلى سلة المهملات وقم بتحديثها ثم حاول مرة أخرى.";
"_list_shares_"                     = "مشاركات";
"_list_shares_no_files_"            = "لا توجد مشاركات حتى الآن";
"_tutorial_list_shares_view_"       = "سوف تظهر هنا كل من الملفات و المجلدات التي قمت بمشاركتها";
"_offline_"                         = "غير متصل";
"_upload_photos_videos_"            = "رفع الصور أو مقاطع الفيديو";
"_upload_file_"                     = "رفع ملف";
"_create_nextcloudtext_document_"   = "إنشاء مستند نصي";
"_use_folder_auto_upload_"          = "إستخدم مجلد \"الرفع التلقائي\" كوجهة";
"_filename_"                        = "اسم الملف";
"_enter_filename_"                  = "أدخِل اسم الملف ...";
"_default_preview_filename_footer_" = "مثال لمعاينة اسم ملف: IMG_0001.JPG";
"_filename_header_"                 = "أدخِل اسم الملف";
"_preview_filename_"                = "مثال لمعاينة اسم الملف. يمكنك استعمال القناع %@ للتاريخ و الوقت.";
"_add_filenametype_"                = "حدد النوع في اسم الملف";
"_maintain_original_filename_"      = "الاحتفاظ باسم الملف الأصلي";
"_notifications_"                   = "الإشعارات";
"_untitled_"                        = "بدون عنوان";
"_e2e_settings_title_"              = "تشفير";
"_e2e_settings_"                    = "التشفير الطرفي ";
"_e2e_settings_start_"              = "إبدأ التشفير الطرفي";
"_e2e_settings_activated_"          = "التشفير الطرفي مفعل";
"_e2e_server_disabled_"             = "التشفير الطرفي معطل على الخادم";
"_e2e_settings_view_passphrase_"    = "الـ 12 كلمة مع بعضها تٌكوِّن عبارة مرور قوّية جداً، تجعلك الوحيد الذي يرى و يستعمل ملفاتك المشفرة. دوّن هذه العبارة و احتفظ بها  في مكانٍّ آمن لحين الحاجة.";
"_e2e_settings_read_passphrase_"    = "إقرأ عبارة المرور";
"_e2e_settings_lock_not_active_"    = "القفل ليس نشطاً. إذهب إلى \"الإعدادات\" وقم بتنشيطه.";
"_e2e_settings_the_passphrase_is_"  = "عبارة المرور هي:";
"_e2e_passphrase_request_title_"    = "طلب عبارة المرور";
"_e2e_passphrase_request_message_"  = "أدخِل الـ 12 كلمة";
"_e2e_settings_remove_"             = "إزالة التشفير المحلي";
"_e2e_settings_remove_message_"     = "أكّد إزالة التشفير مع عبارة المرور";
"_e2e_set_folder_encrypted_"        = "شفّر";
"_e2e_remove_folder_encrypted_"     = "فُكَّ التشفير";
"_e2e_file_encrypted_"              = "File encrypted";
"_e2e_goto_settings_for_enable_"    = "هذا المجلد مشفر، إذهب إلى \"الإعدادات\" وقم بتفعيل التشفير الطرفي";
"_e2e_in_upload_"                   = "التحميل جارٍ... رجاءً، انتظر حتى يتم نقل كل الملفات. ";
"_scans_document_"                  = "المسح الضوئي لمستند";
"_scanned_images_"                  = "صورة ممسوحة ضوئيّاً";
"_scan_document_pdf_page_"          = "الصفحة";
"_scan_label_document_zone_"        = "أنقُر أو اسحَب الصور للأسفل لإنشاء المستند";
"_filter_document_"                 = "مُستند";
"_filter_original_"                 = "أصلي";
"_quality_image_title_"             = "معاينة جودة الصورة";
"_file_creation_"                   = "إنشاء ملف";
"_delete_all_scanned_images_"       = "حذف جميع الصور الممسوحة ضوئيًا";
"_text_recognition_"                = "التعرُّف النَّصِّي";
"_all_files_"                       = "كل الملفات";
"_personal_files_"                  = "الملفات الشخصية";

"_trash_view_"                      = "الملفات المحذوفة";
"_empty_trash_"                     = "إفرَاغ سلة المهملات";
"_trash_no_trash_"                  = "لا توجد ملفات محذوفة";
"_trash_no_trash_description_"      = "يمكنك إستعادة الملفات المحذوفة من هنا";
"_confirm_delete_selected_"         = "هل أنت متأكد أنك ترغب في حذف العناصر المحددة؟";
"_manage_file_offline_"             = "إدارة الملفات دون إتصال بالإنترنت";
"_set_available_offline_"           = "تعيينه كـ\"مُتوفِّر بدون اتصال\"";
"_remove_available_offline_"        = "إزالة تعيينه كـ\"متوفر بدون اتصال\"";
"_create_new_document_"             = "إنشاء مستند جديد";
"_create_new_spreadsheet_"          = "إنشاء جدول بيانات جديد";
"_create_new_presentation_"         = "إنشِيءْ عرضاً تقديمياً جديداً";
"_go_online_"                       = "إذهب متصلاً لترى المستند";
"_intro_1_title_"                   = "حافظ على بياناتك آمنة و تحت سيطرتك";
"_intro_2_title_"                   = "تعاون و تبادل آمن للملفات";
"_intro_3_title_"                   = "سهولة استخدام بريد الويب والتقويم وجهات الاتصال";
"_intro_4_title_"                   = "مشاركة الشاشة والاجتماعات عبر الإنترنت والمؤتمرات عبر الإنترنت";
"_log_in_"                          = "دخول";
"_sign_up_"                         = "التسجيل مع مُزوِّد";
"_host_your_own_server"             = "استضافة الخادم الخاص بك";
"_invalid_url_"                         = "عنوان URL للخادم غير صالح";
"_ssl_certificate_untrusted_"           = "شهادة مصادقة الخادوم غير مقبولة.";
"_ssl_certificate_changed_"             = "شهادة مصادقة الخادوم تمّ تغييرها.";
"_file_already_exists_"                 = "لايمكن الاستمرار في الإجراء. يوجد ملف آخر بنفس الاسم.";
"_error_files_upload_"                  = "خطأ في تحميل الملفات.";
"_internal_generic_error_"              = "خطأ داخلي.";
"_err_permission_microphone_"           = "رجاءً، قم بتمكين لاقط الصوت من الإعدادات.";
"_err_permission_photolibrary_"         = "رجاءً، قم بتمكين الصِّوَر من الإعدادات.";
"_qrcode_not_authorized_"   = "هذا التطبيق غير مأذون له باستعمال الكاميرا الخلفية.";
"_qrcode_not_supported_"    = "رمز الاستجابة السريعة QR غير مدعوم في هذا الجهاز.";
"_create_voice_memo_"       = "إنشاء مذكرة صوتية";
"_voice_memo_start_"        = "أنقُر للبدء";
"_voice_memo_stop_"         = "أنقُر للتوقف";
"Enter Passcode"            = "أدخِل رمزك السّري";
"Enter a new passcode"      = "أدخِل رمزك السّري الجديد";
"Confirm new passcode"      = "تأكيد الرمز السّري الجديد";
"_too_many_failed_passcode_attempts_error_" = "المحاولات الفاشلة لرمز المرور أكثر مما يجب. رجاءً، حاول مرة أخرى.";
"Passcodes didn't match. Try again." = "الرمزان السريان غير متوافقين. أعِد المحاولة.";
"Delete"                    = "حذف ";
"Cancel"                    = "إلغاء";
"_certificate_details_"     = "تفاصيل خادم الشهادة";
"_certificate_pn_details_"  = "تفاصيل الإشعارات المنبثقة بشأن الشهادات";
"_certificate_view_"        = "خادم الشهادة";
"_certificate_pn_view_"     = "إشعار منبثق بشأن شهادة";
"_save_as_scan_"            = "حِفْظٌ كمسحٍ ضوئيٍ";
"_save_changes_"            = "Save changes?";
"_modify_"                  = "عدِّل";
"_overwrite_original_"      = "الكتابة فوق الأصل";
"_save_as_copy_"            = "حفظ كنسخة";
"_discard_changes_"         = "Discard changes";
"_message_disable_overwrite_livephoto_" = "هذه الصورة حية؛ و لن تكون ممكنةً الكتابة عليها.";
"_discard_changes_info_"    = "سوف يتم تجاهل تغييراتك.";
"_delete_files_desc_"       = "حذف ملفات لتفريغ مساحة";
"_delete_old_files_"        = "إحِذف من ذاكرة التخزين المؤقتة جميع الملفات الأقدم من";
"_never_"                   = "بتاتاً";
"_1_year_"                  = "1 سنة ";
"_6_months_"                = "6 اشهر";
"_3_months_"                = "3 اشهر";
"_1_month_"                 = "1 شهر";
"_1_week_"                  = "1 أسبوع ";
"_monthly_"                 = "شهرياً";
"_yearly_"                  = "سنوياً";
"_daily_"                   = "يوميّاً";
"_used_space_"              = "المساحة المستعملة:";
"_login_address_detail_"    = "الرابط إلى %@ الخاص بك سيكون هو واجهة الوِيب عندما تفتحه في المتصفح";
"_go_to_page_"              = "إذهب إلى الصفحة";
"_page_"                    = "صفحة";
"_this_document_has_%@_pages_"              = "يحتوي هذا المستند على %@صفحات";
"_invalid_page_"                            = "صفحة غير صالحة";
"_the_entered_page_number_does_not_exist_"   = "لا توجد صفحة بالرقم الذي أدخلته.";
"_error_something_wrong_"   = "حدث خطأ ما";
"_try_download_full_resolution_"            = "قم بتنزيل الصورة عالية التحديد";
"_full_resolution_image_info_"            = "يمكن أن يُفصِح هذا مزيد من المعلومات عن الصورة.";
"_download_audio_"          = "تنزيل المقطع الصوتي محلياً";
"_copied_path_"             = "المسار المنسوخ";
"_privacy_screen_"          = "Hide content when app is inactive";
"_privacy_screen_footer_"   = "Hide the content in the app and show a splash screen when the app is inactive.";
"_in_"                      = "في";
"_enter_passphrase_"        = "أدخِل عبارة المرور (12 كلمة)";
"_show_more_results_"       = "⋯ Load more results";
"_waiting_for_"             = "إنتظار:";
"_reachable_wifi_"          = "يمكن الوصول إلى الإنترنت عبر Wi-Fi أو الكابل";
"_copy_passphrase_"         = "نسخ عبارة المرور";
"_ok_copy_passphrase_"      = "موافق و انسَخ عبارة المرور";
"_select_color_"            = "تحديد اللون";
"_change_color_"            = "تغيير اللون";
"_description_dashboardwidget_" = "إمتلاك لوحة المعلومات dashboard في متناول أنامِلِك أسهل من أيّ وقتٍ مضى";
"_description_fileswidget_" = "إستعرض ملفاتك التي عملت عليها مؤخراً و استعمل شريط الأدوات لتسريع عملياتك.";
"_description_toolbarwidget_"   = "شريط أدواتٍ toolbar لتسريع عملياتك";
"_title_lockscreenwidget_"  = "الحالة";
"_description_lockscreenwidget_"    = "إنتبه للمساحة المتبقية و الانشطة الأخيرة";

"_keep_running_"            = "إحرِص على تشغيل التطبيق للحصول على تجربة أفضل للمستخدِم.";
"_apps_nextcloud_detect_"   = "تمّ اكتشاف %@ تطبيق";
"_add_existing_account_"    = "%@ تطبيقاً آخر تمّ اكتشافها، هل ترغب في إضافة حسابٍ قائم؟";
"_status_in_progress_"      = "قراءة الحالة قيد التنفيذ...";
"_status_e2ee_on_server_"   = "التشفير من الحدّ للحدّ مهيّأٌ مُسبقاً على هذا الخادوم، لكنه غير مٌمكّن على هذا الجهاز.";
"_status_e2ee_not_setup_"   = "لم تتم حتى الآن تهيئة التشفير من الحدّ للحدّ على هذا الخادوم.";
"_status_e2ee_configured_"  = "التشفير من الحدّ للحدّ مُهيّاٌ بالشكل الصحيح.";
"_e2ee_set_as_offline_"     = "غير ممكن بالنسبة للملفات و المجلدات المشفرة.";
"_change_upload_filename_"  = "هل تريد حفظ الملف باسم مختلف؟";
"_save_file_as_"            = "حفظ الملف كـ %@";
"_password_ascii_"          = "لايمكن لكلمة المرور أن تحتوي على حروف خاصة.";
"_calendar_contacts_"       = "التقويم و جهات الاتصال";
"_mobile_config_"           = "تنزيل ملف تعريف التكوين";
"_calendar_contacts_footer_warning_"    = "لا يمكن تنزيل ملف التهيئة configuration file إلاَ إذا تم تعيين Safari كمتصفح وب افتراضي.";
"_calendar_contacts_footer_"    = "بعد تنزيل الملف الشخصي، يمكنك تثبيته من الإعدادات.";
"_modify_image_desc_"       = "أنقُر على ملف لتعديله أو تغيير اسمه";
"_message_disable_livephoto_" = "هذه الصورة حية؛ تغييرها سيؤدي إلى فقدان تأثير الصورة الحية.";
"_enable_livephoto_"        = "تمكين الصور الحية Live Photo";
"_disable_livephoto_"       = "تعطيل الصور الحية Live Photo";
"_undo_modify_"             = "تراجع عن التعديل";
"_rename_already_exists_"   = "ملف آخر بنفس الاسم موجود مسبقاً.";
"_group_folders_"           = "Team folders";
"_play_from_files_"         = "تشغيل فيديو من ملف";
"_play_from_url_"           = "تشغيل فيديو من عنوان وب";
"_valid_video_url_"         = "أدخِل عنوان URL صحيحِ";
"_chunk_move_"              = "الملف المُرسَل تعذّرت إعادة تجميعه. رجاءً، قم بالتحقق من سجل حركات الخادوم.";
"_download_image_"          = "تنزيل صورة";
"_download_video_"          = "تنزيل فيديو";
"_reset_wrong_passcode_"    = "إعادة تعيين التطبيق";
"_reset_wrong_passcode_option_" = "Reset application after 10 failed attempts";
"_reset_wrong_passcode_desc_" = "Enabling this will remove all accounts and local data after %d failed passcode entry attempts.";
"_deviceOwnerAuthentication_" = "تمّ تعطيل المُستشعِر البيومتري مؤقتًا بسبب المحاولات الفاشلة العديدة. أدخِل رمز مرور الجهاز لإعادة تمكين المُستشعِر.";
"_virus_detect_"            = "تم اكتشاف فيروس. لا يمكن الاستمرار في الرفع!";
"_select_photos_"           = "إختيار الصِّوَر";
"_selected_photo_"          = "الصُّورة المُختارة";
"_selected_photos_"         = "الصِّوَر المُختارة";
"_delete_selected_photos_"  = "حذف الصِّوَر المُحدّدة";
"_media_square_"            = "شَبَك مربع";
"_media_ratio_"             = "شبكة تناسبية ";
"_autoupload_notice_"       = "لضمان الأداء السليم لهذه الميزة، من الضروري تمكين تحديث التطبيق في الخلفية وإلاّ فلن يتم اكتشاف الصور أو مقاطع الفيديو الجديدة عندما يكون التطبيق في الخلفية. \n\nبالإضافة إلى ذلك، يُرجى ملاحظة أن التطبيق لن يكون قادراً على اكتشاف الصور ومقاطع الفيديو الجديدة إذا تمّ إنهاؤه يدوياً. \n\nعندما يكون التطبيق في الخلفية، قد يكون نقل البيانات أبطأ، وسيتم اكتشاف الصور و/أو مقاطع الفيديو الجديدة بشكل عام كل 10 دقائق بحسب مستوى بطارية الجهاز. \n\nللتحقق من أن التطبيق يعمل بشكل صحيح، يمكنك استخدام ملف السجل المتوفر في الإعدادات المتقدمة.";
"_display_"                 = "عرض";
"_appearance_"              = "المظهر";
"_light_"                   = "فاتح";
"_dark_"                    = "داكن";
"_use_system_style_"        = "استعمِل نمط النظام";
"_account_settings_"        = "إعدادات الحساب";
"_users_"                   = "المستخدمين";
"_users_footer_"            = "Allows you to select an account every time you open the app.";
"_while_charging_"          = "إثناء الشحن";
"_keep_screen_awake_"       = "إبقاء الشاشة نشطة\nأثناء نقل الملفات";
"_error_not_found_"         = "المورد المطلوب تعذّر العثور عليه";
"_error_conflict_"          = "تعذّر استكمال الطلب بسبب وجود تعارض مع الحالة الحالية للمورد";
"_error_precondition_"      = "الخادوم لا يلبي أحد الشروط المسبقة للطّالب";
"_downloading_"             = "التنزيل جارٍ ...";
"_additional_options_"      = "إختيارات أخرى";
"_unauthorizedFilesPasscode_" = "تطبيق \"الملفات\" Files لا يمكن استعماله مع رمز مرور نَشِط";
"_disableFilesApp_"         = "تطبيق \"الملفات\" Files لا يمكن استعماله لأنه معطّل";
"_widget_available_nc25_"   = "الودجة widget متاحةٌ فقط بداية من الإصدار 25 فما أحدث";
"_no_items_"                = "لا توجد عناصر";
"_check_back_later_"        = "تحقق مرة أخرى لاحقًا";
"_no_data_available_"       = "لا توجد بيانات";
"_recent_activity_"         = "النشاط الحالي";
"_maintenance_mode_"        = "النظام الآن في حالة صيانة؛ والتي يمكن أن تستغرق بعض الوقت.";
"_account_disabled_"        = "الحساب مُعطَّل";
"_user_"                    = "المستخدم";
"_add_subtitle_"            = "ِإضافة ترجمة خارجية";
"_add_audio_"               = "إضافة صوت خارجي";
"_upload_foreground_msg_"   = "لا تُغلِق %@ لإكمال النقل …";
"_upload_background_msg_"   = "يتم رفع الملفات ...";
"_create_folder_error_"     = "حدث خطأ أثناء إنشاء المجلد:\n%@.\n\nرجاءً، قم بحل هذا الإشكال في أسرع وقت ممكن.\n\nسيتم تعليق كل التحديثات إلى حين حل هذا الإشكال.\n";
"_creating_dir_progress_"   = "جارٍ إنشاء الأدلة ... إبْقِ التطبيق نشطاً.";
"_creating_db_photo_progress_" = "جارٍ إنشاء أرشيف الصِّوَر... إبْقِ التطبيق نشطاً.";
"_account_unauthorized_"    = "There was an issue authorizing the account %@. Please log in again.";
"_folder_offline_desc_"     = "حتى في حالة عدم وجود اتصال بالإنترنت، يمكنك إجراء عمليات التنظيم لمجلداتك و إنشاء الملفات. و بمجرد تحقُّق الاتصال مجدداً، ستتم مزامنة تلك العمليات المعلقة.";
"_offline_not_allowed_"     = "هذه العملية غير ممكنة في حالة عدم الاتصال بالإنترنت";
"_Upload_native_format_yes_"= "الرفع بالتنسيق الأصلي: نعم";
"_Upload_native_format_no_" = "الرفع بالتنسيق الأصلي: لا";
"_terms_of_service_"        = "شروط الخدمة";
"_terms_accept_"            = "أنا أقِرُّ بأني قد قرأت الشروط أعلاه ووافقت عليها.";
"_terms_accepted_"          = "تمّ قبول الشروط";
"_recommended_files_"       = "الملفات المقترحة";
"_propagate_layout_"        = "Apply the following change to all subfolders";
"_version_mismatch_error_"  = "Version change: please open the main app to update the data.";
"_check_auto_upload_"       = "Automatic photo upload is currently disabled.\nWith Nextcloud iOS you can automatically back up your photos and keep them safe on your server.\nJust open Settings → Auto Upload, choose the options you prefer, and turn it on with the \"%@\" button.";
"_cancel_all_request_"      = "Are you sure you want to cancel all transfers?";
"_cancel_all_"              = "Cancel All";
"_dismiss_"                 = "تجاهل";
"_opt_in_pro_"              = "Optimization in progress …";
"_update_in_progress_"      = "Update in progress …";
"_delete_in_progress_"      = "Delete in progress …";
"_download_in_progress_"    = "Download in progress …";
"_upload_in_progress_"      = "Upload in progress …";
"_transfer_in_progress_"    = "Transfer in progress …"; 
"_in_waiting_"              = "In waiting";
"_in_progress_"             = "In progress";
"_in_error_"                = "In error";
"_retry_minutes_"           = "min left to retry";
"_retry_seconds_"           = "sec left to retry";
"_retry_soon_"              = "retrying soon …";
"_large_upload_tip_"        = "Large files require the app to remain open until the transfer is complete";
"_e2ee_upload_tip_"         = "End-to-end files require the app to remain open until the transfer is complete";
"_finalizing_wait_"         = "Waiting for finalization …";
"_in_this_folder_"          = "In this folder";

// Tip
"_tip_pdf_thumbnails_"      = "إسحَب سريعاً من الحافة اليمنى للشاشة إلى اليسار لإظهار الصور المصغرة";
"_tip_accountrequest_"      = "أنقُر هنا لتبديل الحساب أو لإضافة حساب جديد";
"_tip_addcopyimage_"        = "اضغط مع الاستمرار للصق الصورة المنسوخة";
"_tip_open_mediadetail_"    = "إسحب لأعلى لإظهار التفاصيل";
"_tip_autoupload_button_"   = "Configure the options as you prefer (folder, Wi-Fi, new content, subfolders) and tap ‘Turn on auto uploading’.\nYou can stop it at any time, adjust the settings, and enable it again.";

// MARK: Accessibility

// Accessibility, floating panel top element
"_cart_controller_"             = "حاَكِمَة البطاقات Card controller";
"_accessibility_add_upload_"    = "أضِف و ارفَع";
"_dismiss_menu_"                = "رفض القائمة";
"_show_profile_"                = "عرض الملف الشخصي";
// a11y: On/Off
"_on_"                          = "تشغيل";
// a11y: On/Off
"_off_"                         = "إيقاف";
"_list_"                        = "قائمة";
"_icons_"                       = "أيقونات";

// MARK: Assistant
"_assistant_task_unknown_"       = "غير معروف";
"_assistant_task_scheduled_"     = "مُجدوَل";
"_assistant_task_in_progress_"   = "قيد التنفيذ ";
"_assistant_task_completed_"     = "مُنجَز";
"_assistant_task_failed_"        = "أخفَقَ";
"_input_"                        = "مُدخلات";
"_output_"                       = "مُخرجات";
"_task_details_"                 = "تفاصيل المهمة";
"_assistant_"                    = "مُساعِد";
"_new_task_"                     = " %@ مهام جديدة";
"_no_tasks_"                     = "Hello there! What can I help you with today?";
"_create_task_subtitle_"         = "Use the + button to create a new task";
"_edit_task_"                    = "تحرير %@ مهمة";
"_no_types_"                     = "لا يوجد أي مُزوِّد";
"_no_types_subtitle_"            = "يجب تثبيت مزودي الذكاء الاصطناعي حتى يمكن استعمال \"المُساعِد\".";
"_assistant_ai_warning_"         = "Output shown here is generated by AI. Make sure to always double-check.";
"_no_chat_subtitle_"             = "Try sending a message to spark a conversation.";
"_retry_response_generation_"    = "Retry response generation";
"_conversations_"                = "Conversations";
"_new_conversation_"             = "محادثة جديدة";
"_type_message_"                 = "Type a message...";
"_assistant_chat_"               = "Assistant Chat";
"_assistant_error_send_message_"  = "Could not send message. Please try again.";
"_assistant_error_load_messages_" = "Could not load messages. Please try again.";
"_assistant_error_generate_response_" = "Could not generate response. Please try again.";

// MARK: Client certificate
"_no_client_cert_found_"         = "الخادوم يحتاج إلى شهادة عميل.";
"_no_client_cert_found_desc_"    = "هل تريد تثبيت شهادة مصادقة أمنية TLS لعميل نكست كلاود؟ لاحظ أنه يجب تثبيت شهادة .p12 على جهازك أولاً بالنقر فوقها وتثبيتها كملف لتعريف شهادة الهُوِيَّة في الإعدادات. يجب أن تحتوي الشهادة أيضاً على كلمة مرور حيث أن هذا شرط من متطلبات نظام التشغيل iOS.";
"_client_cert_enter_password_"   = "أدخِل كلمة المرور لشهادة المصادقة المُختارة";
"_client_cert_wrong_password_"   = "آسف. أنت أدخَلتَ كلمة مرور غير صحيحة.";

// MARK: Login poll
"_poll_desc_"                    = "رجاءً، أكمل عملية الدخول إلى مُتصفِّحِك.";

// MARK: File name validator (used by NextcloudKit, don't remove)
"_file_name_validator_error_ends_with_space_period_" = "يجب ألّا يحتوي الاسم على فراغات في بدايته أو في نهايته";
"_file_name_validator_error_reserved_name_" = "\"%@\" اسم محظور.";
"_file_name_validator_error_forbidden_file_extension_" = "\".%@\" امتداد ملف محظور.";
"_file_name_validator_error_invalid_character_" = "الاسم يحتوي على حروف غير مسموح بها: \"%@\".";
"_file_name_validator_error_space_" = "يجب ألّا يحتوي الاسم على فراغات في بدايته أو في نهايته";
"_file_name_new_extension_" = "تغيير امتداد الملف يمكن أن يتسبب في تعيين تطبيق آخر لفتح الملف.";
"_file_name_empty_" = "File name cannot be empty.";
"_please_rename_file_" = "رجاءً، قُم تغيير  اسم الملف أو المجلد.";
"hidden_file_name_warning" = "سينتج عن الاسم إخفاء الملف.";

"_camera_roll_" = "فِلْم الكاميرا";
"_destination_" = "الوجهة";
"_select_autoupload_albums_" = "إختَر الألبومات";
"_upload_from_" = "إرفَع من";
"_multiple_albums_" = "ألبومات متعددة";
"_smart_albums_" = "ألبومات ذكية";
"_albums_" = "الألبومات";
"_new_photos_only_" = "الصِّوَر الجديدة فقط";
"_all_photos_" = "كل الصِّوَر";
"_back_up_new_photos_only_" = "النسخ الاحتياطي للصِّوَر والفيديوّات الجديدة فقط";
"_auto_upload_all_photos_warning_title_" = "هل أنت متأكد أنك ترغب في رفع كل الصِّوَر؟";
"_auto_upload_all_photos_warning_message_" = "يمكن أن يستغرق هذا بعض الوقت بحسب عدد الصور.";
"_item_with_same_name_already_exists_" = "An item with the same name already exists.";

// MARK: Migration Multi Domains
"_preparing_migration_" = "Preparing migration …";
"_scanning_files_" = "Scanning files …";
"_moving_items_to_domain_" = "Moving items to correct domain …";
"_finishing_up_" = "Finishing up …";

// MARK: E2EE
"_e2ee_no_session_" = "End-to-end encryption error, no account for this session";
"_e2ee_no_dir_" = "End-to-end encryption error, cannot get directory";
"_e2ee_no_certificate_" = "End-to-end encryption error, cannot get certificate";
"_e2ee_no_generate_key_" = "End-to-end encryption error, cannot generate key";
"_e2ee_no_metadataKey_found_" = "End-to-end encryption error, cannot decrypt metadata key";
"_e2ee_no_user_found_" = "End-to-end encryption error, user not found";
"_e2ee_no_signature_found_" = "End-to-end encryption error, no signature found";
"_e2ee_counter_check_" = "End-to-end encryption error, the counter is lower than the previous one";
"_e2ee_signature_failed_" = "End-to-end encryption error, verify signature failed";
"_e2ee_enc_payload_" = "End-to-end encryption error, encrypt payload file";
"_e2ee_no_metadata_" = "End-to-end encryption error, cannot get metadata";
"_e2ee_filedrop_ciphertext_" = "End-to-end encryption error, filedrop ciphertext failed";
"_e2ee_key_ciphertext_" = "End-to-end encryption error, key ciphertext failed";
"_e2ee_key_checksums_" = "End-to-end encryption error, key checksums failed";
"_e2ee_decode_metadata_" = "End-to-end encryption error, cannot decode metadata";
"_e2ee_no_lock_" = "End-to-end encryption error, unable to lock file";
"_e2ee_no_decrypt_metadata_" = "End-to-end encryption error, cannot decrypt metadata";
"_e2ee_no_enc_file_" = "End-to-end encryption error, cannot encrypt file";
"_e2ee_no_enc_key_" = "End-to-end encryption error, cannot get encoded key";
"_e2ee_no_match_checksum_" = "End-to-end encryption error, checksum does not match";
"_e2ee_create_folder_" = "End-to-end encryption directory creation in progress, please wait …";
"_e2ee_rename_file_" = "End-to-end encryption rename in progress, please wait …";
"_e2ee_encrypt_folder_" = "End-to-end encryption folder in progress, please wait …";
"_e2ee_setup_get_certificate_" = "Server did not return a certificate";
"_e2ee_setup_create_csr_" = "Unable to generate certificate signing request (CSR)";
"_e2ee_setup_sign_certificate_" = "Server did not return a certificate after signing request";
"_e2ee_setup_extract_publickey_" = "Public key mismatch between generated key and certificate";
"_e2ee_setup_get_privatekey_" = "Server did not return an encrypted private key";
"_e2ee_setup_passphrase_error_" = "The provided passphrase is incorrect";
"_e2ee_setup_get_publickey_" = "Server did not return an encrypted public key";
"_e2ee_setup_encript_privatekey_" = "Unable to encrypt the private key";
"_e2ee_setup_store_privatekey_" = "Private key generation returned no usable key";
"_e2ee_setup_verify_publickey_" = "Public key does not match the certificate";
"_e2ee_setup_generate_passphrase_" = "Unable to generate a passphrase";
